{
  "backend/main.mo": "Defines the main backend actor handling authorization, user profiles, products, orders, and storage with associated data types and basic CRUD functions.",
  "backend/migration.mo": "Migrates legacy user profiles to the new profile format by mapping old data to new fields with default email, phone, and buyer role.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and tests for the e‑commerce transformation.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries of various frontend pages, components, and hooks.",
  "frontend/index.html": "HTML entrypoint setting up fonts, favicon, root element, and loading the main frontend script.",
  "frontend/src/App.tsx": "Main React app handling authentication, routing between pages, and role‑based views for buyers, sellers, and admins.",
  "frontend/src/components/CheckInDialog.tsx": "UI dialog for submitting or editing noise and WiFi ratings for a location, with validation and selection controls.",
  "frontend/src/components/EditNameDialog.tsx": "Dialog allowing users to update their profile name by saving changes through the user profile hook.",
  "frontend/src/components/FilterDialog.tsx": "Dialog component for selecting temporary noise and Wi‑Fi filters and applying or clearing them.",
  "frontend/src/components/LocationPreviewCard.tsx": "Provides utilities to compute rating averages and generate HTML for map popups based on location data.",
  "frontend/src/components/MapControls.tsx": "Renders map control buttons for locating the user and toggling manual relocation.",
  "frontend/src/components/MapHeader.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/MapOverlays.tsx": "Shows overlays for relocation mode, loading, errors, and prompting users to set their location.",
  "frontend/src/components/MapSearchBar.tsx": "Search bar with results dropdown, radius selector, and filter dialog for noise and Wi‑Fi.",
  "frontend/src/components/MapView.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/ProductCard.tsx": "Displays product info including image, price, stock status, and handles click navigation.",
  "frontend/src/components/ProductImageUploader.tsx": "Image uploader for products with validation, upload progress, and removal support.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog component that collects user profile info and saves it via a profile mutation hook.",
  "frontend/src/components/ReviewsDialog.tsx": "Empty placeholder file for a reviews dialog component.",
  "frontend/src/components/StoreLayout.tsx": "Main store layout with navigation, mobile menu, header, logout handling, and role-based links.",
  "frontend/src/components/VariantSelector.tsx": "Selector UI for choosing size and color variants and mapping selections to a variant index.",
  "frontend/src/constants/filters.ts": "Defines noise, Wi‑Fi, and radius filter types and option lists for filtering.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminProducts.ts": "Hooks for fetching pending products and approving or rejecting them with query invalidation.",
  "frontend/src/hooks/useCart.ts": "Hooks for CRUD operations on the cart and auto‑refreshing cart queries.",
  "frontend/src/hooks/useGeolocation.ts": "Manages user geolocation with manual setting, auto‑fetching, and callbacks on location changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login, logout, and identity state.",
  "frontend/src/hooks/useMap.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useOrders.ts": "Defines React Query hooks for fetching and mutating order data, including retrieving orders and updating order status.",
  "frontend/src/hooks/useProducts.ts": "Contains hooks for fetching all products or a single product via the actor backend.",
  "frontend/src/hooks/useQueries.ts": "Legacy placeholder file kept for backward compatibility and no longer used.",
  "frontend/src/hooks/useSellerProducts.ts": "Provides hooks for fetching seller-specific products and submitting or updating product data.",
  "frontend/src/hooks/useUserProfile.ts": "Implements hooks for fetching, saving, and checking user profile and admin status via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining theme variables, colors, and layout styling for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and the Internet Identity provider before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin page for viewing, approving, and rejecting pending products with UI controls and notifications.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin interface for viewing all orders and updating their statuses, including filtering states and navigation.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, allowing quantity updates, item removal, and navigation to checkout or catalog.",
  "frontend/src/pages/CatalogPage.tsx": "Shows all products with search filtering and navigation to individual product pages.",
  "frontend/src/pages/CheckoutPage.tsx": "Collects shipping and payment details, calculates totals, and submits an order.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Loads and displays confirmation details for a placed order with navigation options.",
  "frontend/src/pages/OrderDetailPage.tsx": "Fetches and shows detailed order information including items, status, and summary.",
  "frontend/src/pages/OrdersPage.tsx": "Lists the buyer’s past orders with status badges and links to order details.",
  "frontend/src/pages/ProductDetailPage.tsx": "Renders a product detail view with images, variant selection, quantity controls, and add‑to‑cart handling using hooks and toast notifications.",
  "frontend/src/pages/SellerDashboardPage.tsx": "Displays a seller’s product list with status badges and navigation to add products or view orders.",
  "frontend/src/pages/SellerOrdersPage.tsx": "Shows seller-specific orders with status indicators and navigation back to the seller dashboard.",
  "frontend/src/pages/SellerProductFormPage.tsx": "Provides a form for creating or editing products, managing images and variants, and submitting updates via seller hooks.",
  "frontend/src/types/leaflet.d.ts": "Empty TypeScript declaration file for Leaflet-related types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, and enabling plugins for animations and typography.",
  "project_state.json": "JSON snapshot of the SK Selling Clothes web app project containing high‑level goals, architecture notes, issues, required images, and a list of existing implemented or planned features. It mainly tracks storefront, login roles, approval workflows, product features, and payments for build planning."
}